Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sqi.h
#define SQI_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (SQI_CTRLA) Software Reset Position */
#define SQI_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << SQI_CTRLA_SWRST_Pos)               /* (SQI_CTRLA) Software Reset Mask */
#define SQI_CTRLA_SWRST(value)                (SQI_CTRLA_SWRST_Msk & (_UINT32_(value) << SQI_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the SQI_CTRLA register */
#define   SQI_CTRLA_SWRST_LOW_Val             _UINT32_(0x0)                                        /* (SQI_CTRLA) No reset in progress  */
#define   SQI_CTRLA_SWRST_HIGH_Val            _UINT32_(0x1)                                        /* (SQI_CTRLA) Reseting the registers and EIP  */
#define SQI_CTRLA_SWRST_LOW                   (SQI_CTRLA_SWRST_LOW_Val << SQI_CTRLA_SWRST_Pos)     /* (SQI_CTRLA) No reset in progress Position  */
#define SQI_CTRLA_SWRST_HIGH                  (SQI_CTRLA_SWRST_HIGH_Val << SQI_CTRLA_SWRST_Pos)    /* (SQI_CTRLA) Reseting the registers and EIP Position  */
#define SQI_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (SQI_CTRLA) Run in Standby Position */
#define SQI_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << SQI_CTRLA_RUNSTDBY_Pos)            /* (SQI_CTRLA) Run in Standby Mask */
#define SQI_CTRLA_RUNSTDBY(value)             (SQI_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << SQI_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SQI_CTRLA register */
#define   SQI_CTRLA_RUNSTDBY_LOW_Val          _UINT32_(0x0)                                        /* (SQI_CTRLA) Module is disabled in Standby Sleep mode  */
#define   SQI_CTRLA_RUNSTDBY_HIGH_Val         _UINT32_(0x1)                                        /* (SQI_CTRLA) Module continues to run in Standby Sleep mode  */
#define SQI_CTRLA_RUNSTDBY_LOW                (SQI_CTRLA_RUNSTDBY_LOW_Val << SQI_CTRLA_RUNSTDBY_Pos) /* (SQI_CTRLA) Module is disabled in Standby Sleep mode Position  */
#define SQI_CTRLA_RUNSTDBY_HIGH               (SQI_CTRLA_RUNSTDBY_HIGH_Val << SQI_CTRLA_RUNSTDBY_Pos) /* (SQI_CTRLA) Module continues to run in Standby Sleep mode Position  */
#define SQI_CTRLA_Msk                         _UINT32_(0x00000041)                                 /* (SQI_CTRLA) Register Mask  */


/* -------- SQI_INTENCLR : (SQI Offset: 0x10) (R/W 32) Interrupt Enable Clear Register -------- */
#define SQI_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (SQI_INTENCLR) Interrupt Enable Clear Register  Reset Value */

#define SQI_INTENCLR_SQI_Pos                  _UINT32_(0)                                          /* (SQI_INTENCLR) SQI Interrupt Enable Clear Position */
#define SQI_INTENCLR_SQI_Msk                  (_UINT32_(0x1) << SQI_INTENCLR_SQI_Pos)              /* (SQI_INTENCLR) SQI Interrupt Enable Clear Mask */
#define SQI_INTENCLR_SQI(value)               (SQI_INTENCLR_SQI_Msk & (_UINT32_(value) << SQI_INTENCLR_SQI_Pos)) /* Assigment of value for SQI in the SQI_INTENCLR register */
#define   SQI_INTENCLR_SQI_LOW_Val            _UINT32_(0x0)                                        /* (SQI_INTENCLR) Interrupt Enabled  */
#define   SQI_INTENCLR_SQI_HIGH_Val           _UINT32_(0x1)                                        /* (SQI_INTENCLR) Interrupt Disabled  */
#define SQI_INTENCLR_SQI_LOW                  (SQI_INTENCLR_SQI_LOW_Val << SQI_INTENCLR_SQI_Pos)   /* (SQI_INTENCLR) Interrupt Enabled Position  */
#define SQI_INTENCLR_SQI_HIGH                 (SQI_INTENCLR_SQI_HIGH_Val << SQI_INTENCLR_SQI_Pos)  /* (SQI_INTENCLR) Interrupt Disabled Position  */
#define SQI_INTENCLR_Msk                      _UINT32_(0x00000001)                                 /* (SQI_INTENCLR) Register Mask  */


/* -------- SQI_INTENSET : (SQI Offset: 0x14) (R/W 32) Interrupt Enable Set Register -------- */
#define SQI_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (SQI_INTENSET) Interrupt Enable Set Register  Reset Value */

#define SQI_INTENSET_SQI_Pos                  _UINT32_(0)                                          /* (SQI_INTENSET) SQI Interrupt Enable Set Position */
#define SQI_INTENSET_SQI_Msk                  (_UINT32_(0x1) << SQI_INTENSET_SQI_Pos)              /* (SQI_INTENSET) SQI Interrupt Enable Set Mask */
#define SQI_INTENSET_SQI(value)               (SQI_INTENSET_SQI_Msk & (_UINT32_(value) << SQI_INTENSET_SQI_Pos)) /* Assigment of value for SQI in the SQI_INTENSET register */
#define   SQI_INTENSET_SQI_LOW_Val            _UINT32_(0x0)                                        /* (SQI_INTENSET) Interrupt disabled  */
#define   SQI_INTENSET_SQI_HIGH_Val           _UINT32_(0x1)                                        /* (SQI_INTENSET) Interrupt enabled  */
#define SQI_INTENSET_SQI_LOW                  (SQI_INTENSET_SQI_LOW_Val << SQI_INTENSET_SQI_Pos)   /* (SQI_INTENSET) Interrupt disabled Position  */
#define SQI_INTENSET_SQI_HIGH                 (SQI_INTENSET_SQI_HIGH_Val << SQI_INTENSET_SQI_Pos)  /* (SQI_INTENSET) Interrupt enabled Position  */
#define SQI_INTENSET_Msk                      _UINT32_(0x00000001)                                 /* (SQI_INTENSET) Register Mask  */


/* -------- SQI_INTFLAG : (SQI Offset: 0x18) (R/W 32) Interrupt Status and Clear Register -------- */
#define SQI_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (SQI_INTFLAG) Interrupt Status and Clear Register  Reset Value */

#define SQI_INTFLAG_SQI_Pos                   _UINT32_(0)                                          /* (SQI_INTFLAG) Read value reflects the state of the interrupt flag. Do not use the interrupt flag and associated mask registers if the EIP already provides similar controls for its interrupts. This feature is design for interrupts created in the SIB or EIP which do not have mask or flag bits. Write to 1 to clear the flag. Position */
#define SQI_INTFLAG_SQI_Msk                   (_UINT32_(0x1) << SQI_INTFLAG_SQI_Pos)               /* (SQI_INTFLAG) Read value reflects the state of the interrupt flag. Do not use the interrupt flag and associated mask registers if the EIP already provides similar controls for its interrupts. This feature is design for interrupts created in the SIB or EIP which do not have mask or flag bits. Write to 1 to clear the flag. Mask */
#define SQI_INTFLAG_SQI(value)                (SQI_INTFLAG_SQI_Msk & (_UINT32_(value) << SQI_INTFLAG_SQI_Pos)) /* Assigment of value for SQI in the SQI_INTFLAG register */
#define SQI_INTFLAG_Msk                       _UINT32_(0x00000001)                                 /* (SQI_INTFLAG) Register Mask  */


/* -------- SQI_SYNCBUSY : (SQI Offset: 0x20) ( R/ 32) Syncbusy Register -------- */
#define SQI_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (SQI_SYNCBUSY) Syncbusy Register  Reset Value */

#define SQI_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (SQI_SYNCBUSY) Software Reset Synchronization Busy Position */
#define SQI_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << SQI_SYNCBUSY_SWRST_Pos)            /* (SQI_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define SQI_SYNCBUSY_SWRST(value)             (SQI_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << SQI_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the SQI_SYNCBUSY register */
#define   SQI_SYNCBUSY_SWRST_LOW_Val          _UINT32_(0x0)                                        /* (SQI_SYNCBUSY) SWRST synchronization is not busy  */
#define   SQI_SYNCBUSY_SWRST_HIGH_Val         _UINT32_(0x1)                                        /* (SQI_SYNCBUSY) SWRST synchronization is busy  */
#define SQI_SYNCBUSY_SWRST_LOW                (SQI_SYNCBUSY_SWRST_LOW_Val << SQI_SYNCBUSY_SWRST_Pos) /* (SQI_SYNCBUSY) SWRST synchronization is not busy Position  */
#define SQI_SYNCBUSY_SWRST_HIGH               (SQI_SYNCBUSY_SWRST_HIGH_Val << SQI_SYNCBUSY_SWRST_Pos) /* (SQI_SYNCBUSY) SWRST synchronization is busy Position  */
#define SQI_SYNCBUSY_Msk                      _UINT32_(0x00000001)                                 /* (SQI_SYNCBUSY) Register Mask  */


/* -------- SQI_XCON1 : (SQI Offset: 0x100) (R/W 32) SPI XIP Control1 register -------- */
#define SQI_XCON1_RESETVALUE                  _UINT32_(0x202C0C00)                                 /*  (SQI_XCON1) SPI XIP Control1 register  Reset Value */

#define SQI_XCON1_TYPECMD_Pos                 _UINT32_(0)                                          /* (SQI_XCON1) SPI TYPE Command  - Single lane mode, - Dual lane mode, - Quad lane mode, - Reserved for Future use, Based on this field, the boot controller will send the command in 1/2/4 lane. Position */
#define SQI_XCON1_TYPECMD_Msk                 (_UINT32_(0x3) << SQI_XCON1_TYPECMD_Pos)             /* (SQI_XCON1) SPI TYPE Command  - Single lane mode, - Dual lane mode, - Quad lane mode, - Reserved for Future use, Based on this field, the boot controller will send the command in 1/2/4 lane. Mask */
#define SQI_XCON1_TYPECMD(value)              (SQI_XCON1_TYPECMD_Msk & (_UINT32_(value) << SQI_XCON1_TYPECMD_Pos)) /* Assigment of value for TYPECMD in the SQI_XCON1 register */
#define SQI_XCON1_TYPEADDR_Pos                _UINT32_(2)                                          /* (SQI_XCON1) SPI TYPE Address 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use  Based on this field, the boot controller will send  the Address in 1/2/4 lane. Position */
#define SQI_XCON1_TYPEADDR_Msk                (_UINT32_(0x3) << SQI_XCON1_TYPEADDR_Pos)            /* (SQI_XCON1) SPI TYPE Address 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use  Based on this field, the boot controller will send  the Address in 1/2/4 lane. Mask */
#define SQI_XCON1_TYPEADDR(value)             (SQI_XCON1_TYPEADDR_Msk & (_UINT32_(value) << SQI_XCON1_TYPEADDR_Pos)) /* Assigment of value for TYPEADDR in the SQI_XCON1 register */
#define SQI_XCON1_TYPEMODE_Pos                _UINT32_(4)                                          /* (SQI_XCON1) SPI TYPE Mode: 00 - Single lane mode, 01 - Dual lane mode, 10 - Quad lane mode, 11 - Reserved for Future use. Based on this field, the boot controller will send the Mode in 1/2/4 lane. Position */
#define SQI_XCON1_TYPEMODE_Msk                (_UINT32_(0x3) << SQI_XCON1_TYPEMODE_Pos)            /* (SQI_XCON1) SPI TYPE Mode: 00 - Single lane mode, 01 - Dual lane mode, 10 - Quad lane mode, 11 - Reserved for Future use. Based on this field, the boot controller will send the Mode in 1/2/4 lane. Mask */
#define SQI_XCON1_TYPEMODE(value)             (SQI_XCON1_TYPEMODE_Msk & (_UINT32_(value) << SQI_XCON1_TYPEMODE_Pos)) /* Assigment of value for TYPEMODE in the SQI_XCON1 register */
#define SQI_XCON1_TYPEDUMMY_Pos               _UINT32_(6)                                          /* (SQI_XCON1) SPI TYPE DUMMY: 00 - Single lane mode ,01 - Dual lane mode,10 - Quad lane mode ,11 - Reserved for Future use. Based on this field, the boot controller will send the Dummy in 1/2/4 lane. Position */
#define SQI_XCON1_TYPEDUMMY_Msk               (_UINT32_(0x3) << SQI_XCON1_TYPEDUMMY_Pos)           /* (SQI_XCON1) SPI TYPE DUMMY: 00 - Single lane mode ,01 - Dual lane mode,10 - Quad lane mode ,11 - Reserved for Future use. Based on this field, the boot controller will send the Dummy in 1/2/4 lane. Mask */
#define SQI_XCON1_TYPEDUMMY(value)            (SQI_XCON1_TYPEDUMMY_Msk & (_UINT32_(value) << SQI_XCON1_TYPEDUMMY_Pos)) /* Assigment of value for TYPEDUMMY in the SQI_XCON1 register */
#define SQI_XCON1_TYPEDATA_Pos                _UINT32_(8)                                          /* (SQI_XCON1) SPI TYPE DATA: 00 - Single lane mode  ,01 - Dual lane mode  ,10 - Quad lane mode  ,11 - Reserved for Future use  Based on this field, the boot controller will receive the data in 1/2/4 lane. Position */
#define SQI_XCON1_TYPEDATA_Msk                (_UINT32_(0x3) << SQI_XCON1_TYPEDATA_Pos)            /* (SQI_XCON1) SPI TYPE DATA: 00 - Single lane mode  ,01 - Dual lane mode  ,10 - Quad lane mode  ,11 - Reserved for Future use  Based on this field, the boot controller will receive the data in 1/2/4 lane. Mask */
#define SQI_XCON1_TYPEDATA(value)             (SQI_XCON1_TYPEDATA_Msk & (_UINT32_(value) << SQI_XCON1_TYPEDATA_Pos)) /* Assigment of value for TYPEDATA in the SQI_XCON1 register */
#define SQI_XCON1_READOPCODE_Pos              _UINT32_(10)                                         /* (SQI_XCON1) 8bit opcode value for Read operation Position */
#define SQI_XCON1_READOPCODE_Msk              (_UINT32_(0xFF) << SQI_XCON1_READOPCODE_Pos)         /* (SQI_XCON1) 8bit opcode value for Read operation Mask */
#define SQI_XCON1_READOPCODE(value)           (SQI_XCON1_READOPCODE_Msk & (_UINT32_(value) << SQI_XCON1_READOPCODE_Pos)) /* Assigment of value for READOPCODE in the SQI_XCON1 register */
#define SQI_XCON1_ADDRBYTES_Pos               _UINT32_(18)                                         /* (SQI_XCON1) 000  - Zero Address Bytes ,001  - 1 Address Byte ,010  - 2 Address Bytes ,011  - 3 Address Bytes ,100  - 4 Address Bytes ,101  - 111- Reserved for Future Use Position */
#define SQI_XCON1_ADDRBYTES_Msk               (_UINT32_(0x7) << SQI_XCON1_ADDRBYTES_Pos)           /* (SQI_XCON1) 000  - Zero Address Bytes ,001  - 1 Address Byte ,010  - 2 Address Bytes ,011  - 3 Address Bytes ,100  - 4 Address Bytes ,101  - 111- Reserved for Future Use Mask */
#define SQI_XCON1_ADDRBYTES(value)            (SQI_XCON1_ADDRBYTES_Msk & (_UINT32_(value) << SQI_XCON1_ADDRBYTES_Pos)) /* Assigment of value for ADDRBYTES in the SQI_XCON1 register */
#define SQI_XCON1_DUMMYBYTES_Pos              _UINT32_(21)                                         /* (SQI_XCON1) 000  - Zero Dummy bytes ,001  - Transmit one dummy byte (8?h ff) ,010  - Transmit two dummy bytes (16?h ffff) ,011  - Transmit three dummy bytes (24?h ffffff) ,111  - Transmit Seven dummy bytes Position */
#define SQI_XCON1_DUMMYBYTES_Msk              (_UINT32_(0x7) << SQI_XCON1_DUMMYBYTES_Pos)          /* (SQI_XCON1) 000  - Zero Dummy bytes ,001  - Transmit one dummy byte (8?h ff) ,010  - Transmit two dummy bytes (16?h ffff) ,011  - Transmit three dummy bytes (24?h ffffff) ,111  - Transmit Seven dummy bytes Mask */
#define SQI_XCON1_DUMMYBYTES(value)           (SQI_XCON1_DUMMYBYTES_Msk & (_UINT32_(value) << SQI_XCON1_DUMMYBYTES_Pos)) /* Assigment of value for DUMMYBYTES in the SQI_XCON1 register */
#define SQI_XCON1_DDRCMD_Pos                  _UINT32_(24)                                         /* (SQI_XCON1) XIP SPI TYPE CMD DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the command in SDR/DDR mode. Position */
#define SQI_XCON1_DDRCMD_Msk                  (_UINT32_(0x1) << SQI_XCON1_DDRCMD_Pos)              /* (SQI_XCON1) XIP SPI TYPE CMD DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the command in SDR/DDR mode. Mask */
#define SQI_XCON1_DDRCMD(value)               (SQI_XCON1_DDRCMD_Msk & (_UINT32_(value) << SQI_XCON1_DDRCMD_Pos)) /* Assigment of value for DDRCMD in the SQI_XCON1 register */
#define SQI_XCON1_DDRADDR_Pos                 _UINT32_(25)                                         /* (SQI_XCON1) XIP SPI TYPE ADDR DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the address bytes in SDR/DDR mode. Position */
#define SQI_XCON1_DDRADDR_Msk                 (_UINT32_(0x1) << SQI_XCON1_DDRADDR_Pos)             /* (SQI_XCON1) XIP SPI TYPE ADDR DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the address bytes in SDR/DDR mode. Mask */
#define SQI_XCON1_DDRADDR(value)              (SQI_XCON1_DDRADDR_Msk & (_UINT32_(value) << SQI_XCON1_DDRADDR_Pos)) /* Assigment of value for DDRADDR in the SQI_XCON1 register */
#define SQI_XCON1_DDRMODE_Pos                 _UINT32_(26)                                         /* (SQI_XCON1) XIP SPI TYPE MODE DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the mode bytes in SDR/DDR mode. Position */
#define SQI_XCON1_DDRMODE_Msk                 (_UINT32_(0x1) << SQI_XCON1_DDRMODE_Pos)             /* (SQI_XCON1) XIP SPI TYPE MODE DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the mode bytes in SDR/DDR mode. Mask */
#define SQI_XCON1_DDRMODE(value)              (SQI_XCON1_DDRMODE_Msk & (_UINT32_(value) << SQI_XCON1_DDRMODE_Pos)) /* Assigment of value for DDRMODE in the SQI_XCON1 register */
#define SQI_XCON1_DDRDUMMY_Pos                _UINT32_(27)                                         /* (SQI_XCON1) XIP SPI TYPE DUMMY DDR. 0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the dummy bytes in SDR/DDR mode. Position */
#define SQI_XCON1_DDRDUMMY_Msk                (_UINT32_(0x1) << SQI_XCON1_DDRDUMMY_Pos)            /* (SQI_XCON1) XIP SPI TYPE DUMMY DDR. 0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the dummy bytes in SDR/DDR mode. Mask */
#define SQI_XCON1_DDRDUMMY(value)             (SQI_XCON1_DDRDUMMY_Msk & (_UINT32_(value) << SQI_XCON1_DDRDUMMY_Pos)) /* Assigment of value for DDRDUMMY in the SQI_XCON1 register */
#define SQI_XCON1_DDRDATA_Pos                 _UINT32_(28)                                         /* (SQI_XCON1) XIP SPI TYPE DATA DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the data in SDR/DDR mode. Position */
#define SQI_XCON1_DDRDATA_Msk                 (_UINT32_(0x1) << SQI_XCON1_DDRDATA_Pos)             /* (SQI_XCON1) XIP SPI TYPE DATA DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the data in SDR/DDR mode. Mask */
#define SQI_XCON1_DDRDATA(value)              (SQI_XCON1_DDRDATA_Msk & (_UINT32_(value) << SQI_XCON1_DDRDATA_Pos)) /* Assigment of value for DDRDATA in the SQI_XCON1 register */
#define SQI_XCON1_SDRCMD_Pos                  _UINT32_(29)                                         /* (SQI_XCON1) SPI TYPE CMD SDR2DDR: This bit is used by the controller only when  XIP_SPI_TYPE_CMD_DDR is 1?b1 i.e., when command sent in DDR mode. 0 - The command (XIP_SPI_READ_OPCODE) will take 4 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in ddr mode. Here the command will go as 1byte only. 1- The command (XIP_SPI_READ_OPCODE) will take 8 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in sdr mode, but user wants to send in ddr mode. Here the command will go as 2bytes. The value (single byte) programmed in XIP_SPI_READ_OPCODE is replicated into 2bytes by the controller and sent on spi bus. Example for CMD SDR2DDR bit 1: Say opcode = 'h ac (1010 1100) Replicated pattern 11 00 11 00 11 11 00 00 ('h ccf0). So 1st 4 clock cycles hcc; next 4 clock cycles hf0 goes on spi bus. Position */
#define SQI_XCON1_SDRCMD_Msk                  (_UINT32_(0x1) << SQI_XCON1_SDRCMD_Pos)              /* (SQI_XCON1) SPI TYPE CMD SDR2DDR: This bit is used by the controller only when  XIP_SPI_TYPE_CMD_DDR is 1?b1 i.e., when command sent in DDR mode. 0 - The command (XIP_SPI_READ_OPCODE) will take 4 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in ddr mode. Here the command will go as 1byte only. 1- The command (XIP_SPI_READ_OPCODE) will take 8 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in sdr mode, but user wants to send in ddr mode. Here the command will go as 2bytes. The value (single byte) programmed in XIP_SPI_READ_OPCODE is replicated into 2bytes by the controller and sent on spi bus. Example for CMD SDR2DDR bit 1: Say opcode = 'h ac (1010 1100) Replicated pattern 11 00 11 00 11 11 00 00 ('h ccf0). So 1st 4 clock cycles hcc; next 4 clock cycles hf0 goes on spi bus. Mask */
#define SQI_XCON1_SDRCMD(value)               (SQI_XCON1_SDRCMD_Msk & (_UINT32_(value) << SQI_XCON1_SDRCMD_Pos)) /* Assigment of value for SDRCMD in the SQI_XCON1 register */
#define SQI_XCON1_Msk                         _UINT32_(0x3FFFFFFF)                                 /* (SQI_XCON1) Register Mask  */


/* -------- SQI_XCON2 : (SQI Offset: 0x104) (R/W 32) SPI XIP Control2 register -------- */
#define SQI_XCON2_RESETVALUE                  _UINT32_(0xA0)                                       /*  (SQI_XCON2) SPI XIP Control2 register  Reset Value */

#define SQI_XCON2_MODECODE_Pos                _UINT32_(0)                                          /* (SQI_XCON2) 8bit value for Mode byte Position */
#define SQI_XCON2_MODECODE_Msk                (_UINT32_(0xFF) << SQI_XCON2_MODECODE_Pos)           /* (SQI_XCON2) 8bit value for Mode byte Mask */
#define SQI_XCON2_MODECODE(value)             (SQI_XCON2_MODECODE_Msk & (_UINT32_(value) << SQI_XCON2_MODECODE_Pos)) /* Assigment of value for MODECODE in the SQI_XCON2 register */
#define SQI_XCON2_MODEBYTES_Pos               _UINT32_(8)                                          /* (SQI_XCON2) Mode Bytes 00 - 0 Mode Bytes , 01 - 1 Mode Byte , 10 - 2 Mode Bytes , 11 - 3 Mode Bytes Position */
#define SQI_XCON2_MODEBYTES_Msk               (_UINT32_(0x3) << SQI_XCON2_MODEBYTES_Pos)           /* (SQI_XCON2) Mode Bytes 00 - 0 Mode Bytes , 01 - 1 Mode Byte , 10 - 2 Mode Bytes , 11 - 3 Mode Bytes Mask */
#define SQI_XCON2_MODEBYTES(value)            (SQI_XCON2_MODEBYTES_Msk & (_UINT32_(value) << SQI_XCON2_MODEBYTES_Pos)) /* Assigment of value for MODEBYTES in the SQI_XCON2 register */
#define SQI_XCON2_DEVSEL_Pos                  _UINT32_(10)                                         /* (SQI_XCON2) XIP SPI Device Select: This field is used to select a particular SPI device 000 - Select Device0 , 001 - Select Device1 , 010 - Select Device2 , 011 - Select Device3 , 100 - Select Device4 , 101 - Select Device5 , 110 - Select Device6 , 111 - Select Device7 Position */
#define SQI_XCON2_DEVSEL_Msk                  (_UINT32_(0x7) << SQI_XCON2_DEVSEL_Pos)              /* (SQI_XCON2) XIP SPI Device Select: This field is used to select a particular SPI device 000 - Select Device0 , 001 - Select Device1 , 010 - Select Device2 , 011 - Select Device3 , 100 - Select Device4 , 101 - Select Device5 , 110 - Select Device6 , 111 - Select Device7 Mask */
#define SQI_XCON2_DEVSEL(value)               (SQI_XCON2_DEVSEL_Msk & (_UINT32_(value) << SQI_XCON2_DEVSEL_Pos)) /* Assigment of value for DEVSEL in the SQI_XCON2 register */
#define SQI_XCON2_Msk                         _UINT32_(0x00001FFF)                                 /* (SQI_XCON2) Register Mask  */


/* -------- SQI_CFG : (SQI Offset: 0x108) (R/W 32) SPI Configuration Register -------- */
#define SQI_CFG_RESETVALUE                    _UINT32_(0x1007E01)                                  /*  (SQI_CFG) SPI Configuration Register  Reset Value */

