Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sqi.h
#define SQI_STAT2_SQID_Pos                    _UINT32_(3)                                          /* (SQI_STAT2 Position) SPI Data bus:  This status is used to check the SPI DATA line level for Debugging. Bit3 - SPI_IOx ,Bit4 - SPI_IOx ,Bit5 - SPI_IO2 ,Bit6 - SPI_IO3 */
#define SQI_STAT2_SQID_Msk                    (_UINT32_(0xF) << SQI_STAT2_SQID_Pos)                /* (SQI_STAT2 Mask) SQID */
#define SQI_STAT2_SQID(value)                 (SQI_STAT2_SQID_Msk & (_UINT32_(value) << SQI_STAT2_SQID_Pos)) 

/* -------- SQI_BDCON : (SQI Offset: 0x134) (R/W 32) BD_CTRL Register -------- */
#define SQI_BDCON_RESETVALUE                  _UINT32_(0x00)                                       /*  (SQI_BDCON) BD_CTRL Register  Reset Value */

#define SQI_BDCON_DMAEN_Pos                   _UINT32_(0)                                          /* (SQI_BDCON) DMA Enable Bit 1 - Enabled, 0 - Disabled Position */
#define SQI_BDCON_DMAEN_Msk                   (_UINT32_(0x1) << SQI_BDCON_DMAEN_Pos)               /* (SQI_BDCON) DMA Enable Bit 1 - Enabled, 0 - Disabled Mask */
#define SQI_BDCON_DMAEN(value)                (SQI_BDCON_DMAEN_Msk & (_UINT32_(value) << SQI_BDCON_DMAEN_Pos)) /* Assigment of value for DMAEN in the SQI_BDCON register */
#define SQI_BDCON_POLLEN_Pos                  _UINT32_(1)                                          /* (SQI_BDCON) Setting this bit would cause Buffer Descriptor processor (BDP) to poll for descriptor valid till descriptor valid bit is set or till poll counter expires based on value programmed in BD_POLL_CTRL register. Position */
#define SQI_BDCON_POLLEN_Msk                  (_UINT32_(0x1) << SQI_BDCON_POLLEN_Pos)              /* (SQI_BDCON) Setting this bit would cause Buffer Descriptor processor (BDP) to poll for descriptor valid till descriptor valid bit is set or till poll counter expires based on value programmed in BD_POLL_CTRL register. Mask */
#define SQI_BDCON_POLLEN(value)               (SQI_BDCON_POLLEN_Msk & (_UINT32_(value) << SQI_BDCON_POLLEN_Pos)) /* Assigment of value for POLLEN in the SQI_BDCON register */
#define SQI_BDCON_START_Pos                   _UINT32_(2)                                          /* (SQI_BDCON) Setting this bit to '1' would start BDP (Buffer Descriptor Processor) to fetch a  descriptor and hence this bit should be enabled only after all the DMA descriptor programming is done. Hardware clears this bit automatically after one clock cycle. Position */
#define SQI_BDCON_START_Msk                   (_UINT32_(0x1) << SQI_BDCON_START_Pos)               /* (SQI_BDCON) Setting this bit to '1' would start BDP (Buffer Descriptor Processor) to fetch a  descriptor and hence this bit should be enabled only after all the DMA descriptor programming is done. Hardware clears this bit automatically after one clock cycle. Mask */
#define SQI_BDCON_START(value)                (SQI_BDCON_START_Msk & (_UINT32_(value) << SQI_BDCON_START_Pos)) /* Assigment of value for START in the SQI_BDCON register */
#define SQI_BDCON_Msk                         _UINT32_(0x00000007)                                 /* (SQI_BDCON) Register Mask  */


/* -------- SQI_BDCURADD : (SQI Offset: 0x138) ( R/ 32) BD_CURR_ADDR Register -------- */
#define SQI_BDCURADD_RESETVALUE               _UINT32_(0x00)                                       /*  (SQI_BDCURADD) BD_CURR_ADDR Register  Reset Value */

#define SQI_BDCURADD_BDCURRADDR_Pos           _UINT32_(0)                                          /* (SQI_BDCURADD) This register field contains the current descriptor address being processed by Buffer Descriptor Processor (BDP) Position */
#define SQI_BDCURADD_BDCURRADDR_Msk           (_UINT32_(0xFFFFFFFF) << SQI_BDCURADD_BDCURRADDR_Pos) /* (SQI_BDCURADD) This register field contains the current descriptor address being processed by Buffer Descriptor Processor (BDP) Mask */
#define SQI_BDCURADD_BDCURRADDR(value)        (SQI_BDCURADD_BDCURRADDR_Msk & (_UINT32_(value) << SQI_BDCURADD_BDCURRADDR_Pos)) /* Assigment of value for BDCURRADDR in the SQI_BDCURADD register */
#define SQI_BDCURADD_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SQI_BDCURADD) Register Mask  */


/* -------- SQI_BDBASEADD : (SQI Offset: 0x140) (R/W 32) BD_BASE_ADDR register -------- */
#define SQI_BDBASEADD_RESETVALUE              _UINT32_(0x00)                                       /*  (SQI_BDBASEADD) BD_BASE_ADDR register  Reset Value */

#define SQI_BDBASEADD_BDADDR_Pos              _UINT32_(0)                                          /* (SQI_BDBASEADD) This register field contains the base address of the DMA. This register must be updated only when the DMA is IDLE. Position */
#define SQI_BDBASEADD_BDADDR_Msk              (_UINT32_(0xFFFFFFFF) << SQI_BDBASEADD_BDADDR_Pos)   /* (SQI_BDBASEADD) This register field contains the base address of the DMA. This register must be updated only when the DMA is IDLE. Mask */
#define SQI_BDBASEADD_BDADDR(value)           (SQI_BDBASEADD_BDADDR_Msk & (_UINT32_(value) << SQI_BDBASEADD_BDADDR_Pos)) /* Assigment of value for BDADDR in the SQI_BDBASEADD register */
#define SQI_BDBASEADD_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (SQI_BDBASEADD) Register Mask  */


/* -------- SQI_BDSTAT : (SQI Offset: 0x144) ( R/ 32) BD_STATUS Register -------- */
#define SQI_BDSTAT_BDCON_Pos                  _UINT32_(0)                                          /* (SQI_BDSTAT) This register field contains the current Descriptor control information. Bits [31:16] of BD_CTRL field of current descriptor are indicated in this register field. Position */
#define SQI_BDSTAT_BDCON_Msk                  (_UINT32_(0xFFFF) << SQI_BDSTAT_BDCON_Pos)           /* (SQI_BDSTAT) This register field contains the current Descriptor control information. Bits [31:16] of BD_CTRL field of current descriptor are indicated in this register field. Mask */
#define SQI_BDSTAT_BDCON(value)               (SQI_BDSTAT_BDCON_Msk & (_UINT32_(value) << SQI_BDSTAT_BDCON_Pos)) /* Assigment of value for BDCON in the SQI_BDSTAT register */
#define SQI_BDSTAT_DMAACTV_Pos                _UINT32_(16)                                         /* (SQI_BDSTAT) A value of '1' would indicate that Buffer Descriptor Processor (BDP) is not Idle. Value of '0' would indicate that BDP is in IDLE state Position */
#define SQI_BDSTAT_DMAACTV_Msk                (_UINT32_(0x1) << SQI_BDSTAT_DMAACTV_Pos)            /* (SQI_BDSTAT) A value of '1' would indicate that Buffer Descriptor Processor (BDP) is not Idle. Value of '0' would indicate that BDP is in IDLE state Mask */
#define SQI_BDSTAT_DMAACTV(value)             (SQI_BDSTAT_DMAACTV_Msk & (_UINT32_(value) << SQI_BDSTAT_DMAACTV_Pos)) /* Assigment of value for DMAACTV in the SQI_BDSTAT register */
#define SQI_BDSTAT_DMASTART_Pos               _UINT32_(17)                                         /* (SQI_BDSTAT) This register field would indicate whether DMA has started or not, if bit it set '1', then it indicates DMA start has happened. Value of '0' would indicate that DMA hasn't started. Position */
#define SQI_BDSTAT_DMASTART_Msk               (_UINT32_(0x1) << SQI_BDSTAT_DMASTART_Pos)           /* (SQI_BDSTAT) This register field would indicate whether DMA has started or not, if bit it set '1', then it indicates DMA start has happened. Value of '0' would indicate that DMA hasn't started. Mask */
#define SQI_BDSTAT_DMASTART(value)            (SQI_BDSTAT_DMASTART_Msk & (_UINT32_(value) << SQI_BDSTAT_DMASTART_Pos)) /* Assigment of value for DMASTART in the SQI_BDSTAT register */
#define SQI_BDSTAT_BDSTATE_Pos                _UINT32_(18)                                         /* (SQI_BDSTAT) This register field contains current BDP state :  0  IDLE, 1  Descriptor fetch Request Pending, 2  BD loading, 3  Data phase , 4  Descriptor Done, 5  Fetched BD is disabled, 6  Wait for Control Buffer Available, 7  Wait for AHB Error Acknowledgement Position */
#define SQI_BDSTAT_BDSTATE_Msk                (_UINT32_(0xF) << SQI_BDSTAT_BDSTATE_Pos)            /* (SQI_BDSTAT) This register field contains current BDP state :  0  IDLE, 1  Descriptor fetch Request Pending, 2  BD loading, 3  Data phase , 4  Descriptor Done, 5  Fetched BD is disabled, 6  Wait for Control Buffer Available, 7  Wait for AHB Error Acknowledgement Mask */
#define SQI_BDSTAT_BDSTATE(value)             (SQI_BDSTAT_BDSTATE_Msk & (_UINT32_(value) << SQI_BDSTAT_BDSTATE_Pos)) /* Assigment of value for BDSTATE in the SQI_BDSTAT register */
#define SQI_BDSTAT_Msk                        _UINT32_(0x003FFFFF)                                 /* (SQI_BDSTAT) Register Mask  */


/* -------- SQI_BDPOLLCON : (SQI Offset: 0x148) (R/W 32) BD_POLL_CTRL Register -------- */
#define SQI_BDPOLLCON_POLLCON_Pos             _UINT32_(0)                                          /* (SQI_BDPOLLCON) Number of cycles that BDP block would wait before re-fetching the Descriptor control word if the previous descriptor fetched was disabled Position */
#define SQI_BDPOLLCON_POLLCON_Msk             (_UINT32_(0xFFFF) << SQI_BDPOLLCON_POLLCON_Pos)      /* (SQI_BDPOLLCON) Number of cycles that BDP block would wait before re-fetching the Descriptor control word if the previous descriptor fetched was disabled Mask */
#define SQI_BDPOLLCON_POLLCON(value)          (SQI_BDPOLLCON_POLLCON_Msk & (_UINT32_(value) << SQI_BDPOLLCON_POLLCON_Pos)) /* Assigment of value for POLLCON in the SQI_BDPOLLCON register */
#define SQI_BDPOLLCON_Msk                     _UINT32_(0x0000FFFF)                                 /* (SQI_BDPOLLCON) Register Mask  */


