Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sqi.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SQI_DESCRIPTOR register API structure */
typedef struct
{  /* Polaris Serial Quad Interface SIB */
  __IO  uint32_t                       SQI_BDCTRL;         /**< Offset: 0x00 (R/W  32) Buffer Descriptor Control Register */
  __IO  uint32_t                       SQI_BDSTATUS;       /**< Offset: 0x04 (R/W  32) Buffer Descriptor Status Register */
  __IO  uint32_t                       SQI_BDADDR;         /**< Offset: 0x08 (R/W  32) Buffer Descriptor Address Register */
  __IO  uint32_t                       SQI_BDNXTPTR;       /**< Offset: 0x0C (R/W  32) Buffer Descriptor Next Pointer Register */
} sqi_descriptor_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/** \brief SQI register API structure */
typedef struct
{  /* Polaris Serial Quad Interface SIB */
  __IO  uint32_t                       SQI_CTRLA;          /**< Offset: 0x00 (R/W  32) Control A register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       SQI_INTENCLR;       /**< Offset: 0x10 (R/W  32) Interrupt Enable Clear Register */
  __IO  uint32_t                       SQI_INTENSET;       /**< Offset: 0x14 (R/W  32) Interrupt Enable Set Register */
  __IO  uint32_t                       SQI_INTFLAG;        /**< Offset: 0x18 (R/W  32) Interrupt Status and Clear Register */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       SQI_SYNCBUSY;       /**< Offset: 0x20 (R/   32) Syncbusy Register */
  __I   uint8_t                        Reserved3[0xDC];
  __IO  uint32_t                       SQI_XCON1;          /**< Offset: 0x100 (R/W  32) SPI XIP Control1 register */
  __IO  uint32_t                       SQI_XCON2;          /**< Offset: 0x104 (R/W  32) SPI XIP Control2 register */
  __IO  uint32_t                       SQI_CFG;            /**< Offset: 0x108 (R/W  32) SPI Configuration Register */
  __IO  uint32_t                       SQI_CON;            /**< Offset: 0x10C (R/W  32) SPI Control register */
  __IO  uint32_t                       SQI_CLKCON;         /**< Offset: 0x110 (R/W  32) SPI Clock Control register */
  __IO  uint32_t                       SQI_CMDTHR;         /**< Offset: 0x114 (R/W  32) SPI command threshold register */
  __IO  uint32_t                       SQI_INTTHR;         /**< Offset: 0x118 (R/W  32) SPI Interrupt Threshold register */
  __IO  uint32_t                       SQI_INTEN;          /**< Offset: 0x11C (R/W  32) SPI Interrupt Enable Register */
  __IO  uint32_t                       SQI_INTSTAT;        /**< Offset: 0x120 (R/W  32) SPI Interrupt Status Register */
  __IO  uint32_t                       SQI_TXDATA;         /**< Offset: 0x124 (R/W  32) SPI Transmit Data Register */
  __I   uint32_t                       SQI_RXDATA;         /**< Offset: 0x128 (R/   32) SPI Receive Data Register */
  __I   uint32_t                       SQI_STAT1;          /**< Offset: 0x12C (R/   32) SPI Status1 Register */
  __I   uint32_t                       SQI_STAT2;          /**< Offset: 0x130 (R/   32) SPI status 2 register */
  __IO  uint32_t                       SQI_BDCON;          /**< Offset: 0x134 (R/W  32) BD_CTRL Register */
  __I   uint32_t                       SQI_BDCURADD;       /**< Offset: 0x138 (R/   32) BD_CURR_ADDR Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       SQI_BDBASEADD;      /**< Offset: 0x140 (R/W  32) BD_BASE_ADDR register */
  __I   uint32_t                       SQI_BDSTAT;         /**< Offset: 0x144 (R/   32) BD_STATUS Register */
  __IO  uint32_t                       SQI_BDPOLLCON;      /**< Offset: 0x148 (R/W  32) BD_POLL_CTRL Register */
  __IO  uint32_t                       SQI_BDTXDSTAT;      /**< Offset: 0x14C (R/W  32) BD_TX_DMA_STATUS Register */
  __I   uint32_t                       SQI_BDRXDSTAT;      /**< Offset: 0x150 (R/   32) BD_RX_DMA_STATUS Register */
  __IO  uint32_t                       SQI_THR;            /**< Offset: 0x154 (R/W  32) SPI Control threshold register */
  __IO  uint32_t                       SQI_INTSIGEN;       /**< Offset: 0x158 (R/W  32) SPI Interrupt Signal Enable Register */
  __IO  uint32_t                       SQI_TAPCON;         /**< Offset: 0x15C (R/W  32) Tap Control Register */
  __IO  uint32_t                       SQI_MEMSTAT;        /**< Offset: 0x160 (R/W  32) SPI Status Control Register */
  __IO  uint32_t                       SQI_XCON3;          /**< Offset: 0x164 (R/W  32) SPI XIP Control 3 Register */
  __IO  uint32_t                       SQI_XCON4;          /**< Offset: 0x168 (R/W  32) SPI XIP Control4 Register */
} sqi_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** \brief SQI_DESCRIPTOR memory section attribute */
#if defined (__GNUC__) || defined (__CC_ARM)
 #define SECTION_SQI_DESCRIPTOR       __attribute__ ((section(".flexram")))
#elif defined (__ICCARM__)
 #define SECTION_SQI_DESCRIPTOR       @".flexram"
#else
 #ifndef SECTION_SQI_DESCRIPTOR
  #error SECTION_SQI_DESCRIPTOR must be defined for compiler to use memory section .flexram
 #endif
#endif

#endif /* _PIC32CZCA80_SQI_COMPONENT_H_ */
